mlyszczek/nuttx/arch/arm/src/imxrt/chip/imxrt105x6x_xbar.h
/* XBARB3 Mux inputs (I values) *******************************************************************************************************************/

#define IMXRT_XBARB3_IN_LOGIC_LOW                        IMXRT_XBARB3(XBAR_INPUT, 0)    /* LOGIC_LOW output assigned to XBARB3_IN0 input. */
#define IMXRT_XBARB3_IN_LOGIC_HIGH                       IMXRT_XBARB3(XBAR_INPUT, 1)    /* LOGIC_HIGH output assigned to XBARB3_IN1 input. */
#define IMXRT_XBARB3_IN_RESERVED2                        IMXRT_XBARB3(XBAR_INPUT, 2)    /* XBARB3_IN2 input is reserved. */
#define IMXRT_XBARB3_IN_RESERVED3                        IMXRT_XBARB3(XBAR_INPUT, 3)    /* XBARB3_IN3 input is reserved. */
#define IMXRT_XBARB3_IN_RESERVED4                        IMXRT_XBARB3(XBAR_INPUT, 4)    /* XBARB3_IN4 input is reserved. */
#define IMXRT_XBARB3_IN_RESERVED5                        IMXRT_XBARB3(XBAR_INPUT, 5)    /* XBARB3_IN5 input is reserved. */
#define IMXRT_XBARB3_IN_ACMP1_OUT                        IMXRT_XBARB3(XBAR_INPUT, 6)    /* ACMP1_OUT output assigned to XBARB3_IN6 input. */
#define IMXRT_XBARB3_IN_ACMP2_OUT                        IMXRT_XBARB3(XBAR_INPUT, 7)    /* ACMP2_OUT output assigned to XBARB3_IN7 input. */
#define IMXRT_XBARB3_IN_ACMP3_OUT                        IMXRT_XBARB3(XBAR_INPUT, 8)    /* ACMP3_OUT output assigned to XBARB3_IN8 input. */
#define IMXRT_XBARB3_IN_ACMP4_OUT                        IMXRT_XBARB3(XBAR_INPUT, 9)    /* ACMP4_OUT output assigned to XBARB3_IN9 input. */
#define IMXRT_XBARB3_IN_RESERVED10                       IMXRT_XBARB3(XBAR_INPUT, 10)   /* XBARB3_IN10 input is reserved. */
#define IMXRT_XBARB3_IN_RESERVED11                       IMXRT_XBARB3(XBAR_INPUT, 11)   /* XBARB3_IN11 input is reserved. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR0_OUT                 IMXRT_XBARB3(XBAR_INPUT, 12)   /* QTIMER3_TMR0_OUTPUT output assigned to XBARB3_IN12 input. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR1_OUT                 IMXRT_XBARB3(XBAR_INPUT, 13)   /* QTIMER3_TMR1_OUTPUT output assigned to XBARB3_IN13 input. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR2_OUT                 IMXRT_XBARB3(XBAR_INPUT, 14)   /* QTIMER3_TMR2_OUTPUT output assigned to XBARB3_IN14 input. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR3_OUT                 IMXRT_XBARB3(XBAR_INPUT, 15)   /* QTIMER3_TMR3_OUTPUT output assigned to XBARB3_IN15 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR0_OUT                 IMXRT_XBARB3(XBAR_INPUT, 16)   /* QTIMER4_TMR0_OUTPUT output assigned to XBARB3_IN16 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR1_OUT                 IMXRT_XBARB3(XBAR_INPUT, 17)   /* QTIMER4_TMR1_OUTPUT output assigned to XBARB3_IN17 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR2_OUT                 IMXRT_XBARB3(XBAR_INPUT, 18)   /* QTIMER4_TMR2_OUTPUT output assigned to XBARB3_IN18 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR3_OUT                 IMXRT_XBARB3(XBAR_INPUT, 19)   /* QTIMER4_TMR3_OUTPUT output assigned to XBARB3_IN19 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM1_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 20)   /* FLEXPWM1_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN20 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM2_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 21)   /* FLEXPWM1_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN21 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM3_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 22)   /* FLEXPWM1_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN22 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM4_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 23)   /* FLEXPWM1_PWM4_OUT_TRIG0_1 output assigned to XBARB3_IN23 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM1_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 24)   /* FLEXPWM2_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN24 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM2_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 25)   /* FLEXPWM2_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN25 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM3_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 26)   /* FLEXPWM2_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN26 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM4_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 27)   /* FLEXPWM2_PWM4_OUT_TRIG0_1 output assigned to XBARB3_IN27 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM1_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 28)   /* FLEXPWM3_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN28 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM2_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 29)   /* FLEXPWM3_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN29 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM3_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 30)   /* FLEXPWM3_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN30 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM4_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 31)   /* FLEXPWM3_PWM4_OUT_TRIG0_1 output assigned to XBARB3_IN31 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM1_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 32)   /* FLEXPWM4_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN32 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM2_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 33)   /* FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN33 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM3_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 34)   /* FLEXPWM4_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN34 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM4_OUT_TRIG01         IMXRT_XBARB3(XBAR_INPUT, 35)   /* FLEXPWM4_PWM4_OUT_TRIG0_1 output assigned to XBARB3_IN35 input. */
#define IMXRT_XBARB3_IN_PIT_TRIGGER0                     IMXRT_XBARB3(XBAR_INPUT, 36)   /* PIT_TRIGGER0 output assigned to XBARB3_IN36 input. */
#define IMXRT_XBARB3_IN_PIT_TRIGGER1                     IMXRT_XBARB3(XBAR_INPUT, 37)   /* PIT_TRIGGER1 output assigned to XBARB3_IN37 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR0_COCO0              IMXRT_XBARB3(XBAR_INPUT, 38)   /* ADC_ETC_XBAR0_COCO0 output assigned to XBARB3_IN38 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR0_COCO1              IMXRT_XBARB3(XBAR_INPUT, 39)   /* ADC_ETC_XBAR0_COCO1 output assigned to XBARB3_IN39 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR0_COCO2              IMXRT_XBARB3(XBAR_INPUT, 40)   /* ADC_ETC_XBAR0_COCO2 output assigned to XBARB3_IN40 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR0_COCO3              IMXRT_XBARB3(XBAR_INPUT, 41)   /* ADC_ETC_XBAR0_COCO3 output assigned to XBARB3_IN41 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR1_COCO0              IMXRT_XBARB3(XBAR_INPUT, 42)   /* ADC_ETC_XBAR1_COCO0 output assigned to XBARB3_IN42 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR1_COCO1              IMXRT_XBARB3(XBAR_INPUT, 43)   /* ADC_ETC_XBAR1_COCO1 output assigned to XBARB3_IN43 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR1_COCO2              IMXRT_XBARB3(XBAR_INPUT, 44)   /* ADC_ETC_XBAR1_COCO2 output assigned to XBARB3_IN44 input. */
#define IMXRT_XBARB3_IN_ADC_ETC_XBAR1_COCO3              IMXRT_XBARB3(XBAR_INPUT, 45)   /* ADC_ETC_XBAR1_COCO3 output assigned to XBARB3_IN45 input. */
#define IMXRT_XBARB3_IN_ENC1_POS_MATCH                   IMXRT_XBARB3(XBAR_INPUT, 46)   /* ENC1_POS_MATCH output assigned to XBARB3_IN46 input. */
#define IMXRT_XBARB3_IN_ENC2_POS_MATCH                   IMXRT_XBARB3(XBAR_INPUT, 47)   /* ENC2_POS_MATCH output assigned to XBARB3_IN47 input. */
#define IMXRT_XBARB3_IN_ENC3_POS_MATCH                   IMXRT_XBARB3(XBAR_INPUT, 48)   /* ENC3_POS_MATCH output assigned to XBARB3_IN48 input. */
#define IMXRT_XBARB3_IN_ENC4_POS_MATCH                   IMXRT_XBARB3(XBAR_INPUT, 49)   /* ENC4_POS_MATCH output assigned to XBARB3_IN49 input. */
#define IMXRT_XBARB3_IN_DMA_DONE0                        IMXRT_XBARB3(XBAR_INPUT, 50)   /* DMA_DONE0 output assigned to XBARB3_IN50 input. */
#define IMXRT_XBARB3_IN_DMA_DONE1                        IMXRT_XBARB3(XBAR_INPUT, 51)   /* DMA_DONE1 output assigned to XBARB3_IN51 input. */
#define IMXRT_XBARB3_IN_DMA_DONE2                        IMXRT_XBARB3(XBAR_INPUT, 52)   /* DMA_DONE2 output assigned to XBARB3_IN52 input. */
#define IMXRT_XBARB3_IN_DMA_DONE3                        IMXRT_XBARB3(XBAR_INPUT, 53)   /* DMA_DONE3 output assigned to XBARB3_IN53 input. */
#define IMXRT_XBARB3_IN_DMA_DONE4                        IMXRT_XBARB3(XBAR_INPUT, 54)   /* DMA_DONE4 output assigned to XBARB3_IN54 input. */
#define IMXRT_XBARB3_IN_DMA_DONE5                        IMXRT_XBARB3(XBAR_INPUT, 55)   /* DMA_DONE5 output assigned to XBARB3_IN55 input. */
#define IMXRT_XBARB3_IN_DMA_DONE6                        IMXRT_XBARB3(XBAR_INPUT, 56)   /* DMA_DONE6 output assigned to XBARB3_IN56 input. */
#define IMXRT_XBARB3_IN_DMA_DONE7                        IMXRT_XBARB3(XBAR_INPUT, 57)   /* DMA_DONE7 output assigned to XBARB3_IN57 input. */

/* XBARB3 Mux Output  (M Muxes) ********************************************************************************************************************/

#define IMXRT_XBARB3_OUT_AOI2_IN00_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 0)    /* XBARB3_OUT0 output assigned to AOI2_IN00 */
#define IMXRT_XBARB3_OUT_AOI2_IN01_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 1)    /* XBARB3_OUT1 output assigned to AOI2_IN01 */
#define IMXRT_XBARB3_OUT_AOI2_IN02_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 2)    /* XBARB3_OUT2 output assigned to AOI2_IN02 */
#define IMXRT_XBARB3_OUT_AOI2_IN03_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 3)    /* XBARB3_OUT3 output assigned to AOI2_IN03 */
#define IMXRT_XBARB3_OUT_AOI2_IN04_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 4)    /* XBARB3_OUT4 output assigned to AOI2_IN04 */
#define IMXRT_XBARB3_OUT_AOI2_IN05_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 5)    /* XBARB3_OUT5 output assigned to AOI2_IN05 */
#define IMXRT_XBARB3_OUT_AOI2_IN06_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 6)    /* XBARB3_OUT6 output assigned to AOI2_IN06 */
#define IMXRT_XBARB3_OUT_AOI2_IN07_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 7)    /* XBARB3_OUT7 output assigned to AOI2_IN07 */
#define IMXRT_XBARB3_OUT_AOI2_IN08_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 8)    /* XBARB3_OUT8 output assigned to AOI2_IN08 */
#define IMXRT_XBARB3_OUT_AOI2_IN09_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 9)    /* XBARB3_OUT9 output assigned to AOI2_IN09 */
#define IMXRT_XBARB3_OUT_AOI2_IN10_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 10)   /* XBARB3_OUT10 output assigned to AOI2_IN10 */
#define IMXRT_XBARB3_OUT_AOI2_IN11_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 11)   /* XBARB3_OUT11 output assigned to AOI2_IN11 */
#define IMXRT_XBARB3_OUT_AOI2_IN12_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 12)   /* XBARB3_OUT12 output assigned to AOI2_IN12 */
#define IMXRT_XBARB3_OUT_AOI2_IN13_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 13)   /* XBARB3_OUT13 output assigned to AOI2_IN13 */
#define IMXRT_XBARB3_OUT_AOI2_IN14_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 14)   /* XBARB3_OUT14 output assigned to AOI2_IN14 */
#define IMXRT_XBARB3_OUT_AOI2_IN15_SEL_OFFSET            IMXRT_XBARB3(XBAR_OUTPUT, 15)   /* XBARB3_OUT15 output assigned to AOI2_IN15 */
